Config/DataProcessors/ПроверкаКассовойКниги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПроверкаКассовойКниги</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВывестиНаПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Обособленное подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЛистыБезДвижений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяКнига</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛистыКассовойКниги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исправить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонОстБюджет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонОстБюджетУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонОстВнеБюдж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонОстВнеБюджУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛистКассовойКниги</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЛистКассовойКниги_52н</v8:Type>
								<v8:Type>cfg:DocumentRef.ЛистКассовойКнигиФондовый</v8:Type>
								<v8:Type>cfg:DocumentRef.ЛистКассовойКниги</v8:Type>
								<v8:Type>cfg:DocumentRef.ЛистКассовойКнигиФондовый_52н</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачОстБюджет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачОстБюджетУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачОстВнеБюдж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачОстВнеБюджУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходБюджет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходБюджетУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходВнеБюдж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходВнеБюджУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходБюджет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходБюджетУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходВнеБюдж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходВнеБюджУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расхождения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фондовый</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонОстУчреждение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонОстУчреждениеУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонОстВремРасп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонОстВремРаспУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачОстУчреждение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачОстУчреждениеУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачОстВремРасп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачОстВремРаспУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходУчреждение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходУчреждение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходВремРасп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходВремРасп</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходУчреждениеУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходУчреждениеУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходВремРаспУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходВремРаспУч</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рабочий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/DataProcessors/ПроверкаКассовойКниги/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ДниНедели;

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьТабличнуюЧастьЭлектронныеЛисты() Экспорт
	
	ЛистыКассовойКниги.Очистить();
	
	ЛистыКассовойКниги.Загрузить(КассаОрганизации.ЭлектронныеЛистыКассовойКнигиЗаПериод(ДатаНачала, ДатаКонца, Организация, Подразделение));
	
КонецПроцедуры	

// Процедура проверяет необходимость листов кассовой книги по каждому дню из выбранного периода
// и сопоставляет с имеющимися листами.
//
Процедура ЗаполнитьТабличнуюЧасть() Экспорт
	
	ЛистыКассовойКниги.Очистить();
	
	ОрганизацииДляОтбора = Справочники.Организации.ВсеСубъектыУчетаПолномочий(Организация);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНачала",						НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаКонца",						КонецДня(ДатаКонца));
	Запрос.УстановитьПараметр("Организация",					ОрганизацииДляОтбора);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям",				Не ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("Подразделение",					Подразделение);
	Запрос.УстановитьПараметр("ЕстьПодразделение",				ЗначениеЗаполнено(Подразделение));
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КОНЕЦПЕРИОДА(ПриходныйКассовыйОрдер.Дата, ДЕНЬ) КАК ДатаОтч,
	|	ПриходныйКассовыйОрдер.ВалютаДокумента КАК Валюта,
	|	ЛОЖЬ КАК Фондовый
	|ПОМЕСТИТЬ ДолжныБытьЛисты
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	(ПриходныйКассовыйОрдер.Организация В (&Организация)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (&ЕстьПодразделение
	|				И ПриходныйКассовыйОрдер.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ПриходныйКассовыйОрдер.Подразделение ЕСТЬ NULL 
	|					ИЛИ ПриходныйКассовыйОрдер.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ ПриходныйКассовыйОрдер.Подразделение.ВедетсяКассоваяКнига))
	|	И ПриходныйКассовыйОрдер.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И ПриходныйКассовыйОрдер.Проведен
	|	И ПриходныйКассовыйОрдер.Оплачено
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(РасходныйКассовыйОрдер.Дата, ДЕНЬ),
	|	РасходныйКассовыйОрдер.ВалютаДокумента,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	(РасходныйКассовыйОрдер.Организация В (&Организация)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (&ЕстьПодразделение
	|				И РасходныйКассовыйОрдер.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (РасходныйКассовыйОрдер.Подразделение ЕСТЬ NULL 
	|					ИЛИ РасходныйКассовыйОрдер.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ РасходныйКассовыйОрдер.Подразделение.ВедетсяКассоваяКнига))
	|	И РасходныйКассовыйОрдер.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И РасходныйКассовыйОрдер.Проведен
	|	И РасходныйКассовыйОрдер.Оплачено
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ВедомостьНаВыдачуДенегИзКассыРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ),
	|	ВедомостьНаВыдачуДенегИзКассыРасшифровкаПлатежа.Ссылка.ВалютаДокумента,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ВедомостьНаВыдачуДенегИзКассы.РасшифровкаПлатежа КАК ВедомостьНаВыдачуДенегИзКассыРасшифровкаПлатежа
	|ГДЕ
	|	(ВедомостьНаВыдачуДенегИзКассыРасшифровкаПлатежа.Ссылка.Организация В (&Организация)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (&ЕстьПодразделение
	|				И ВедомостьНаВыдачуДенегИзКассыРасшифровкаПлатежа.Ссылка.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ВедомостьНаВыдачуДенегИзКассыРасшифровкаПлатежа.Ссылка.Подразделение ЕСТЬ NULL 
	|					ИЛИ ВедомостьНаВыдачуДенегИзКассыРасшифровкаПлатежа.Ссылка.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ ВедомостьНаВыдачуДенегИзКассыРасшифровкаПлатежа.Ссылка.Подразделение.ВедетсяКассоваяКнига))
	|	И ВедомостьНаВыдачуДенегИзКассыРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И ВедомостьНаВыдачуДенегИзКассыРасшифровкаПлатежа.Ссылка.Проведен
	|	И ВедомостьНаВыдачуДенегИзКассыРасшифровкаПлатежа.Ссылка.Оплачено
	|	И ВедомостьНаВыдачуДенегИзКассыРасшифровкаПлатежа.Выплачено
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Дата, ДЕНЬ),
	|	ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.ВалютаДокумента,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПлатежнаяВедомость.РасшифровкаПлатежа КАК ПлатежнаяВедомостьРасшифровкаПлатежа
	|ГДЕ
	|	(ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Организация В (&Организация)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (&ЕстьПодразделение
	|				И ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Подразделение ЕСТЬ NULL 
	|					ИЛИ ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Подразделение.ВедетсяКассоваяКнига))
	|	И ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Проведен
	|	И ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Оплачено
	|	И ПлатежнаяВедомостьРасшифровкаПлатежа.Выплачено
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ЛистКассовойКниги.Дата, ДЕНЬ),
	|	ЛистКассовойКниги.ВалютаДокумента,
	|	ЛистКассовойКниги.Фондовый
	|ИЗ
	|	&ДокументЛистКассовойКниги КАК ЛистКассовойКниги
	|ГДЕ
	|	(ЛистКассовойКниги.Организация В (&Организация)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (&ЕстьПодразделение
	|				И ЛистКассовойКниги.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ЛистКассовойКниги.Подразделение ЕСТЬ NULL 
	|					ИЛИ ЛистКассовойКниги.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига))
	|	И ЛистКассовойКниги.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ПриходныйОрдерФондовый.Дата, ДЕНЬ),
	|	&ВалютаРегламентированногоУчета,
	|	ИСТИНА
	|ИЗ
	|	Документ.ПриходныйОрдерФондовый КАК ПриходныйОрдерФондовый
	|ГДЕ
	|	(ПриходныйОрдерФондовый.Организация В (&Организация)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (&ЕстьПодразделение
	|				И ПриходныйОрдерФондовый.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ПриходныйОрдерФондовый.Подразделение ЕСТЬ NULL 
	|					ИЛИ ПриходныйОрдерФондовый.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ ПриходныйОрдерФондовый.Подразделение.ВедетсяКассоваяКнига))
	|	И ПриходныйОрдерФондовый.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И ПриходныйОрдерФондовый.Проведен
	|	И ПриходныйОрдерФондовый.Оплачено
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(РасходныйОрдерФондовый.Дата, ДЕНЬ),
	|	&ВалютаРегламентированногоУчета,
	|	ИСТИНА
	|ИЗ
	|	Документ.РасходныйОрдерФондовый КАК РасходныйОрдерФондовый
	|ГДЕ
	|	(РасходныйОрдерФондовый.Организация В (&Организация)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (&ЕстьПодразделение
	|				И РасходныйОрдерФондовый.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (РасходныйОрдерФондовый.Подразделение ЕСТЬ NULL 
	|					ИЛИ РасходныйОрдерФондовый.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ РасходныйОрдерФондовый.Подразделение.ВедетсяКассоваяКнига))
	|	И РасходныйОрдерФондовый.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И РасходныйОрдерФондовый.Проведен
	|	И РасходныйОрдерФондовый.Оплачено
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ЛистКассовойКнигиФондовый.Дата, ДЕНЬ),
	|	&ВалютаРегламентированногоУчета,
	|	ИСТИНА
	|ИЗ
	|	&ДокументЛистКассовойКнигиФондовый КАК ЛистКассовойКнигиФондовый
	|ГДЕ
	|	(ЛистКассовойКнигиФондовый.Организация В (&Организация)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (&ЕстьПодразделение
	|				И ЛистКассовойКнигиФондовый.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ЛистКассовойКнигиФондовый.Подразделение ЕСТЬ NULL 
	|					ИЛИ ЛистКассовойКнигиФондовый.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига))
	|	И ЛистКассовойКнигиФондовый.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛистКассовойКниги.Ссылка КАК Ссылка,
	|	ЛистКассовойКниги.ВалютаДокумента КАК ВалютаДокумента,
	|	КОНЕЦПЕРИОДА(ЛистКассовойКниги.Дата, ДЕНЬ) КАК Дата,
	|	ЛистКассовойКниги.ПриходБюджет КАК ПриходБюджет,
	|	ЛистКассовойКниги.РасходБюджет КАК РасходБюджет,
	|	ЛистКассовойКниги.ПриходВнеБюдж КАК ПриходВнеБюдж,
	|	ЛистКассовойКниги.РасходВнеБюдж КАК РасходВнеБюдж,
	|	ЛистКассовойКниги.Фондовый КАК Фондовый,
	|	ЛистКассовойКниги.НачалоДняБюджет КАК НачалоДняБюджет,
	|	ЛистКассовойКниги.НачалоДняВнеБюдж КАК НачалоДняВнеБюдж,
	|	ЛистКассовойКниги.КонецДняБюджет КАК КонецДняБюджет,
	|	ЛистКассовойКниги.КонецДняВнеБюдж КАК КонецДняВнеБюдж,
	|	ЛистКассовойКниги.КонецДняУчреждение КАК КонОстУчреждение,
	|	ЛистКассовойКниги.КонецДняВремРасп КАК КонОстВремРасп,
	|	ЛистКассовойКниги.НачалоДняУчреждение КАК НачОстУчреждение,
	|	ЛистКассовойКниги.НачалоДняВремРасп КАК НачОстВремРасп,
	|	ЛистКассовойКниги.ПриходУчреждение КАК ПриходУчреждение,
	|	ЛистКассовойКниги.РасходУчреждение КАК РасходУчреждение,
	|	ЛистКассовойКниги.ПриходВремРасп КАК ПриходВремРасп,
	|	ЛистКассовойКниги.РасходВремРасп КАК РасходВремРасп
	|ПОМЕСТИТЬ Листы
	|ИЗ
	|	Документ.ЛистКассовойКниги_52н КАК ЛистКассовойКниги
	|ГДЕ
	|	(ЛистКассовойКниги.Организация В (&Организация)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (&ЕстьПодразделение
	|				И ЛистКассовойКниги.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ЛистКассовойКниги.Подразделение ЕСТЬ NULL 
	|					ИЛИ ЛистКассовойКниги.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига))
	|	И ЛистКассовойКниги.Проведен
	|	И ЛистКассовойКниги.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛистКассовойКнигиФондовый.Ссылка,
	|	&ВалютаРегламентированногоУчета,
	|	КОНЕЦПЕРИОДА(ЛистКассовойКнигиФондовый.Дата, ДЕНЬ),
	|	ЛистКассовойКнигиФондовый.ПриходБюджет,
	|	ЛистКассовойКнигиФондовый.РасходБюджет,
	|	ЛистКассовойКнигиФондовый.ПриходВнеБюдж,
	|	ЛистКассовойКнигиФондовый.РасходВнеБюдж,
	|	ИСТИНА,
	|	ЛистКассовойКнигиФондовый.НачалоДняБюджет,
	|	ЛистКассовойКнигиФондовый.НачалоДняВнеБюдж,
	|	ЛистКассовойКнигиФондовый.КонецДняБюджет,
	|	ЛистКассовойКнигиФондовый.КонецДняВнеБюдж,
	|	ЛистКассовойКнигиФондовый.КонецДняУчреждение,
	|	ЛистКассовойКнигиФондовый.КонецДняВремРасп,
	|	ЛистКассовойКнигиФондовый.НачалоДняУчреждение,
	|	ЛистКассовойКнигиФондовый.НачалоДняВремРасп,
	|	ЛистКассовойКнигиФондовый.ПриходУчреждение,
	|	ЛистКассовойКнигиФондовый.РасходУчреждение,
	|	ЛистКассовойКнигиФондовый.ПриходВремРасп,
	|	ЛистКассовойКнигиФондовый.РасходВремРасп
	|ИЗ
	|	Документ.ЛистКассовойКнигиФондовый_52н КАК ЛистКассовойКнигиФондовый
	|ГДЕ
	|	(ЛистКассовойКнигиФондовый.Организация В (&Организация)
	|			ИЛИ &ПоВсемОрганизациям)
	|	И (&ЕстьПодразделение
	|				И ЛистКассовойКнигиФондовый.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ЛистКассовойКнигиФондовый.Подразделение ЕСТЬ NULL 
	|					ИЛИ ЛистКассовойКнигиФондовый.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|					ИЛИ НЕ ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига))
	|	И ЛистКассовойКнигиФондовый.Дата МЕЖДУ &ДатаНачала И &ДатаКонца
	|	И ЛистКассовойКнигиФондовый.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(Т.ПриходБюджетУч) КАК ПриходБюджетУч,
	|	СУММА(Т.ПриходВнеБюджУч) КАК ПриходВнеБюджУч,
	|	Т.Дата,
	|	Т.Валюта,
	|	СУММА(Т.РасходБюджетУч) КАК РасходБюджетУч,
	|	СУММА(Т.РасходВнеБюджУч) КАК РасходВнеБюджУч,
	|	Т.Фондовый,
	|	СУММА(Т.НачОстБюджет) КАК НачОстБюджет,
	|	СУММА(Т.НачОстВнеБюдж) КАК НачОстВнеБюдж,
	|	СУММА(Т.КонОстБюджет) КАК КонОстБюджет,
	|	СУММА(Т.КонОстВнеБюдж) КАК КонОстВнеБюдж,
	|	СУММА(Т.КонОстУчреждение) КАК КонОстУчреждение,
	|	СУММА(Т.КонОстВремРасп) КАК КонОстВремРасп,
	|	СУММА(Т.НачОстУчреждение) КАК НачОстУчреждение,
	|	СУММА(Т.НачОстВремРасп) КАК НачОстВремРасп,
	|	СУММА(Т.ПриходУчреждение) КАК ПриходУчреждение,
	|	СУММА(Т.РасходУчреждение) КАК РасходУчреждение,
	|	СУММА(Т.ПриходВремРасп) КАК ПриходВремРасп,
	|	СУММА(Т.РасходВремРасп) КАК РасходВремРасп
	|ПОМЕСТИТЬ ДанныеРегистра
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА НаличныеДенежныеСредстваОстаткиИОбороты.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА НаличныеДенежныеСредстваОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриходБюджетУч,
	|		ВЫБОР
	|			КОГДА НаличныеДенежныеСредстваОстаткиИОбороты.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА НаличныеДенежныеСредстваОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриходВнеБюджУч,
	|		КОНЕЦПЕРИОДА(НаличныеДенежныеСредстваОстаткиИОбороты.Период, ДЕНЬ) КАК Дата,
	|		НаличныеДенежныеСредстваОстаткиИОбороты.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА НаличныеДенежныеСредстваОстаткиИОбороты.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА НаличныеДенежныеСредстваОстаткиИОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходБюджетУч,
	|		ВЫБОР
	|			КОГДА НаличныеДенежныеСредстваОстаткиИОбороты.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА НаличныеДенежныеСредстваОстаткиИОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходВнеБюджУч,
	|		ЛОЖЬ КАК Фондовый,
	|		0 КАК НачОстБюджет,
	|		0 КАК НачОстВнеБюдж,
	|		0 КАК КонОстБюджет,
	|		0 КАК КонОстВнеБюдж,
	|		0 КАК КонОстУчреждение,
	|		0 КАК КонОстВремРасп,
	|		0 КАК НачОстУчреждение,
	|		0 КАК НачОстВремРасп,
	|		ВЫБОР
	|			КОГДА НаличныеДенежныеСредстваОстаткиИОбороты.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА НаличныеДенежныеСредстваОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриходУчреждение,
	|		ВЫБОР
	|			КОГДА НаличныеДенежныеСредстваОстаткиИОбороты.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА НаличныеДенежныеСредстваОстаткиИОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходУчреждение,
	|		ВЫБОР
	|			КОГДА НаличныеДенежныеСредстваОстаткиИОбороты.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА НаличныеДенежныеСредстваОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриходВремРасп,
	|		ВЫБОР
	|			КОГДА НаличныеДенежныеСредстваОстаткиИОбороты.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА НаличныеДенежныеСредстваОстаткиИОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходВремРасп
	|	ИЗ
	|		РегистрНакопления.НаличныеДенежныеСредства.ОстаткиИОбороты(
	|				&ДатаНачала,
	|				&ДатаКонца,
	|				День,
	|				Движения,
	|				Организация В (&Организация)
	|					ИЛИ &ПоВсемОрганизациям) КАК НаличныеДенежныеСредстваОстаткиИОбороты
	|	ГДЕ
	|		(&ЕстьПодразделение
	|					И НаличныеДенежныеСредстваОстаткиИОбороты.Подразделение = &Подразделение
	|				ИЛИ НЕ &ЕстьПодразделение
	|					И (НаличныеДенежныеСредстваОстаткиИОбороты.Подразделение ЕСТЬ NULL 
	|						ИЛИ НаличныеДенежныеСредстваОстаткиИОбороты.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ДенежныеДокументыОстаткиИОбороты.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА ДенежныеДокументыОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДенежныеДокументыОстаткиИОбороты.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА ДенежныеДокументыОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		КОНЕЦПЕРИОДА(ДенежныеДокументыОстаткиИОбороты.Период, ДЕНЬ),
	|		&ВалютаРегламентированногоУчета,
	|		ВЫБОР
	|			КОГДА ДенежныеДокументыОстаткиИОбороты.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА ДенежныеДокументыОстаткиИОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДенежныеДокументыОстаткиИОбороты.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА ДенежныеДокументыОстаткиИОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ИСТИНА,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА ДенежныеДокументыОстаткиИОбороты.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА ДенежныеДокументыОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДенежныеДокументыОстаткиИОбороты.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА ДенежныеДокументыОстаткиИОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДенежныеДокументыОстаткиИОбороты.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА ДенежныеДокументыОстаткиИОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДенежныеДокументыОстаткиИОбороты.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА ДенежныеДокументыОстаткиИОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ДенежныеДокументы.ОстаткиИОбороты(
	|				&ДатаНачала,
	|				&ДатаКонца,
	|				День,
	|				Движения,
	|				Организация В (&Организация)
	|					ИЛИ &ПоВсемОрганизациям) КАК ДенежныеДокументыОстаткиИОбороты
	|	ГДЕ
	|		(&ЕстьПодразделение
	|					И ДенежныеДокументыОстаткиИОбороты.Подразделение = &Подразделение
	|				ИЛИ НЕ &ЕстьПодразделение
	|					И (ДенежныеДокументыОстаткиИОбороты.Подразделение ЕСТЬ NULL 
	|						ИЛИ ДенежныеДокументыОстаткиИОбороты.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		0,
	|		КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ),
	|		НаличныеДенежныеСредстваОстатки.Валюта,
	|		0,
	|		0,
	|		ЛОЖЬ,
	|		ВЫБОР
	|			КОГДА НаличныеДенежныеСредстваОстатки.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА НаличныеДенежныеСредстваОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НаличныеДенежныеСредстваОстатки.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА НаличныеДенежныеСредстваОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА НаличныеДенежныеСредстваОстатки.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА НаличныеДенежныеСредстваОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА НаличныеДенежныеСредстваОстатки.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА НаличныеДенежныеСредстваОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.НаличныеДенежныеСредства.Остатки(
	|				&ДатаНачала,
	|				Организация В (&Организация)
	|					ИЛИ &ПоВсемОрганизациям) КАК НаличныеДенежныеСредстваОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		0,
	|		КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ),
	|		&ВалютаРегламентированногоУчета,
	|		0,
	|		0,
	|		ИСТИНА,
	|		ВЫБОР
	|			КОГДА ДенежныеДокументыОстатки.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА ДенежныеДокументыОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДенежныеДокументыОстатки.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА ДенежныеДокументыОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА ДенежныеДокументыОстатки.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА ДенежныеДокументыОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ДенежныеДокументыОстатки.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА ДенежныеДокументыОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.ДенежныеДокументы.Остатки(
	|				&ДатаНачала,
	|				Организация В (&Организация)
	|					ИЛИ &ПоВсемОрганизациям) КАК ДенежныеДокументыОстатки) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Дата,
	|	Т.Валюта,
	|	Т.Фондовый
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеРегистра.Дата = ДанныеРегистра1.Дата
	|				ТОГДА ДанныеРегистра1.ПриходБюджетУч
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПриходБюджетУч,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеРегистра.Дата = ДанныеРегистра1.Дата
	|				ТОГДА ДанныеРегистра1.ПриходВнеБюджУч
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПриходВнеБюджУч,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеРегистра.Дата = ДанныеРегистра1.Дата
	|				ТОГДА ДанныеРегистра1.РасходБюджетУч
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РасходБюджетУч,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеРегистра.Дата = ДанныеРегистра1.Дата
	|				ТОГДА ДанныеРегистра1.РасходВнеБюджУч
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РасходВнеБюджУч,
	|	СУММА(ДанныеРегистра1.НачОстБюджет + ВЫБОР
	|			КОГДА ДанныеРегистра.Дата > ДанныеРегистра1.Дата
	|				ТОГДА ДанныеРегистра1.ПриходБюджетУч - ДанныеРегистра1.РасходБюджетУч
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачОстБюджет,
	|	СУММА(ДанныеРегистра1.НачОстВнеБюдж + ВЫБОР
	|			КОГДА ДанныеРегистра.Дата > ДанныеРегистра1.Дата
	|				ТОГДА ДанныеРегистра1.ПриходВнеБюджУч - ДанныеРегистра1.РасходВнеБюджУч
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачОстВнеБюдж,
	|	СУММА(ДанныеРегистра1.НачОстБюджет + ДанныеРегистра1.ПриходБюджетУч - ДанныеРегистра1.РасходБюджетУч) КАК КонОстБюджет,
	|	СУММА(ДанныеРегистра1.НачОстВнеБюдж + ДанныеРегистра1.ПриходВнеБюджУч - ДанныеРегистра1.РасходВнеБюджУч) КАК КонОстВнеБюдж,
	|	СУММА(ДанныеРегистра1.НачОстУчреждение + ДанныеРегистра1.ПриходУчреждение - ДанныеРегистра1.РасходУчреждение) КАК КонОстУчреждение,
	|	СУММА(ДанныеРегистра1.НачОстВремРасп + ДанныеРегистра1.ПриходВремРасп - ДанныеРегистра1.РасходВремРасп) КАК КонОстВремРасп,
	|	СУММА(ДанныеРегистра1.НачОстУчреждение + ВЫБОР
	|			КОГДА ДанныеРегистра.Дата > ДанныеРегистра1.Дата
	|				ТОГДА ДанныеРегистра1.ПриходУчреждение - ДанныеРегистра1.РасходУчреждение
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачОстУчреждение,
	|	СУММА(ДанныеРегистра1.НачОстВремРасп + ВЫБОР
	|			КОГДА ДанныеРегистра.Дата > ДанныеРегистра1.Дата
	|				ТОГДА ДанныеРегистра1.ПриходВремРасп - ДанныеРегистра1.РасходВремРасп
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачОстВремРасп,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеРегистра.Дата = ДанныеРегистра1.Дата
	|				ТОГДА ДанныеРегистра1.ПриходУчреждение
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПриходУчреждение,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеРегистра.Дата = ДанныеРегистра1.Дата
	|				ТОГДА ДанныеРегистра1.РасходУчреждение
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РасходУчреждение,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеРегистра.Дата = ДанныеРегистра1.Дата
	|				ТОГДА ДанныеРегистра1.ПриходВремРасп
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПриходВремРасп,
	|	СУММА(ВЫБОР
	|			КОГДА ДанныеРегистра.Дата = ДанныеРегистра1.Дата
	|				ТОГДА ДанныеРегистра1.РасходВремРасп
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РасходВремРасп,
	|	ДанныеРегистра.Дата,
	|	ДанныеРегистра.Валюта,
	|	ДанныеРегистра.Фондовый
	|ПОМЕСТИТЬ ВложенныйЗапрос
	|ИЗ
	|	ДанныеРегистра КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеРегистра КАК ДанныеРегистра1
	|		ПО ДанныеРегистра.Валюта = ДанныеРегистра1.Валюта
	|			И ДанныеРегистра.Фондовый = ДанныеРегистра1.Фондовый
	|			И ДанныеРегистра.Дата >= ДанныеРегистра1.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.Дата,
	|	ДанныеРегистра.Валюта,
	|	ДанныеРегистра.Фондовый
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДолжныБытьЛисты.ДатаОтч КАК Дата,
	|	ДолжныБытьЛисты.Валюта КАК Валюта,
	|	ДолжныБытьЛисты.Фондовый КАК Фондовый,
	|	Листы.Ссылка КАК ЛистКассовойКниги,
	|	СУММА(ЕСТЬNULL(Листы.ПриходБюджет, 0)) КАК ПриходБюджет,
	|	СУММА(ЕСТЬNULL(Листы.РасходБюджет, 0)) КАК РасходБюджет,
	|	СУММА(ЕСТЬNULL(Листы.ПриходВнеБюдж, 0)) КАК ПриходВнеБюдж,
	|	СУММА(ЕСТЬNULL(Листы.РасходВнеБюдж, 0)) КАК РасходВнеБюдж,
	|	СУММА(ЕСТЬNULL(Листы.ПриходУчреждение, 0)) КАК ПриходУчреждение,
	|	СУММА(ЕСТЬNULL(Листы.РасходУчреждение, 0)) КАК РасходУчреждение,
	|	СУММА(ЕСТЬNULL(Листы.ПриходВремРасп, 0)) КАК ПриходВремРасп,
	|	СУММА(ЕСТЬNULL(Листы.РасходВремРасп, 0)) КАК РасходВремРасп,
	|	СУММА(ЕСТЬNULL(Ордера.ПриходБюджетУч, 0)) КАК ПриходБюджетУч,
	|	СУММА(ЕСТЬNULL(Ордера.ПриходВнеБюджУч, 0)) КАК ПриходВнеБюджУч,
	|	СУММА(ЕСТЬNULL(Ордера.РасходБюджетУч, 0)) КАК РасходБюджетУч,
	|	СУММА(ЕСТЬNULL(Ордера.РасходВнеБюджУч, 0)) КАК РасходВнеБюджУч,
	|	СУММА(ЕСТЬNULL(Ордера.ПриходУчреждениеУч, 0)) КАК ПриходУчреждениеУч,
	|	СУММА(ЕСТЬNULL(Ордера.РасходУчреждениеУч, 0)) КАК РасходУчреждениеУч,
	|	СУММА(ЕСТЬNULL(Ордера.ПриходВремРаспУч, 0)) КАК ПриходВремРаспУч,
	|	СУММА(ЕСТЬNULL(Ордера.РасходВремРаспУч, 0)) КАК РасходВремРаспУч,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Листы.ПриходУчреждение, 0) <> ЕСТЬNULL(Ордера.ПриходУчреждениеУч, 0)
	|				ИЛИ ЕСТЬNULL(Листы.РасходУчреждение, 0) <> ЕСТЬNULL(Ордера.РасходУчреждениеУч, 0)
	|				ИЛИ ЕСТЬNULL(Листы.ПриходВремРасп, 0) <> ЕСТЬNULL(Ордера.ПриходВремРаспУч, 0)
	|				ИЛИ ЕСТЬNULL(Листы.РасходВремРасп, 0) <> ЕСТЬNULL(Ордера.РасходВремРаспУч, 0)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Расхождения,
	|	СУММА(ЕСТЬNULL(Листы.НачалоДняБюджет, 0)) КАК НачОстБюджет,
	|	СУММА(ЕСТЬNULL(Листы.НачалоДняВнеБюдж, 0)) КАК НачОстВнеБюдж,
	|	СУММА(ЕСТЬNULL(Листы.КонецДняБюджет, 0)) КАК КонОстБюджет,
	|	СУММА(ЕСТЬNULL(Листы.КонецДняВнеБюдж, 0)) КАК КонОстВнеБюдж,
	|	СУММА(ЕСТЬNULL(Листы.КонОстУчреждение, 0)) КАК КонОстУчреждение,
	|	СУММА(ЕСТЬNULL(Листы.КонОстВремРасп, 0)) КАК КонОстВремРасп,
	|	СУММА(ЕСТЬNULL(Листы.НачОстУчреждение, 0)) КАК НачОстУчреждение,
	|	СУММА(ЕСТЬNULL(Листы.НачОстВремРасп, 0)) КАК НачОстВремРасп,
	|	СУММА(ЕСТЬNULL(Ордера.НачОстБюджетУч, 0)) КАК НачОстБюджетУч,
	|	СУММА(ЕСТЬNULL(Ордера.НачОстВнеБюджУч, 0)) КАК НачОстВнеБюджУч,
	|	СУММА(ЕСТЬNULL(Ордера.КонОстБюджетУч, 0)) КАК КонОстБюджетУч,
	|	СУММА(ЕСТЬNULL(Ордера.КонОстВнеБюджУч, 0)) КАК КонОстВнеБюджУч,
	|	СУММА(ЕСТЬNULL(Ордера.КонОстУчреждениеУч, 0)) КАК КонОстУчреждениеУч,
	|	СУММА(ЕСТЬNULL(Ордера.КонОстВремРаспУч, 0)) КАК КонОстВремРаспУч,
	|	СУММА(ЕСТЬNULL(Ордера.НачОстУчреждениеУч, 0)) КАК НачОстУчреждениеУч,
	|	СУММА(ЕСТЬNULL(Ордера.НачОстВремРаспУч, 0)) КАК НачОстВремРаспУч
	|ИЗ
	|	ДолжныБытьЛисты КАК ДолжныБытьЛисты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Листы КАК Листы
	|		ПО ДолжныБытьЛисты.ДатаОтч = Листы.Дата
	|			И ДолжныБытьЛисты.Валюта = Листы.ВалютаДокумента
	|			И ДолжныБытьЛисты.Фондовый = Листы.Фондовый
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА(ВложенныйЗапрос.ПриходБюджетУч) КАК ПриходБюджетУч,
	|			СУММА(ВложенныйЗапрос.ПриходВнеБюджУч) КАК ПриходВнеБюджУч,
	|			ВложенныйЗапрос.Дата КАК Дата,
	|			ВложенныйЗапрос.Валюта КАК Валюта,
	|			СУММА(ВложенныйЗапрос.РасходБюджетУч) КАК РасходБюджетУч,
	|			СУММА(ВложенныйЗапрос.РасходВнеБюджУч) КАК РасходВнеБюджУч,
	|			ВложенныйЗапрос.Фондовый КАК Фондовый,
	|			СУММА(ВложенныйЗапрос.НачОстБюджет) КАК НачОстБюджетУч,
	|			СУММА(ВложенныйЗапрос.НачОстВнеБюдж) КАК НачОстВнеБюджУч,
	|			СУММА(ВложенныйЗапрос.КонОстБюджет) КАК КонОстБюджетУч,
	|			СУММА(ВложенныйЗапрос.КонОстВнеБюдж) КАК КонОстВнеБюджУч,
	|			СУММА(ВложенныйЗапрос.КонОстУчреждение) КАК КонОстУчреждениеУч,
	|			СУММА(ВложенныйЗапрос.КонОстВремРасп) КАК КонОстВремРаспУч,
	|			СУММА(ВложенныйЗапрос.НачОстУчреждение) КАК НачОстУчреждениеУч,
	|			СУММА(ВложенныйЗапрос.НачОстВремРасп) КАК НачОстВремРаспУч,
	|			СУММА(ВложенныйЗапрос.ПриходУчреждение) КАК ПриходУчреждениеУч,
	|			СУММА(ВложенныйЗапрос.РасходУчреждение) КАК РасходУчреждениеУч,
	|			СУММА(ВложенныйЗапрос.ПриходВремРасп) КАК ПриходВремРаспУч,
	|			СУММА(ВложенныйЗапрос.РасходВремРасп) КАК РасходВремРаспУч
	|		ИЗ
	|			ВложенныйЗапрос КАК ВложенныйЗапрос
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВложенныйЗапрос.Дата,
	|			ВложенныйЗапрос.Валюта,
	|			ВложенныйЗапрос.Фондовый) КАК Ордера
	|		ПО ДолжныБытьЛисты.ДатаОтч = Ордера.Дата
	|			И ДолжныБытьЛисты.Валюта = Ордера.Валюта
	|			И ДолжныБытьЛисты.Фондовый = Ордера.Фондовый
	|
	|СГРУППИРОВАТЬ ПО
	|	ДолжныБытьЛисты.ДатаОтч,
	|	ДолжныБытьЛисты.Валюта,
	|	ДолжныБытьЛисты.Фондовый,
	|	Листы.Ссылка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Листы.ПриходУчреждение, 0) <> ЕСТЬNULL(Ордера.ПриходУчреждениеУч, 0)
	|				ИЛИ ЕСТЬNULL(Листы.РасходУчреждение, 0) <> ЕСТЬNULL(Ордера.РасходУчреждениеУч, 0)
	|				ИЛИ ЕСТЬNULL(Листы.ПриходВремРасп, 0) <> ЕСТЬNULL(Ордера.ПриходВремРаспУч, 0)
	|				ИЛИ ЕСТЬNULL(Листы.РасходВремРасп, 0) <> ЕСТЬNULL(Ордера.РасходВремРаспУч, 0)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Валюта,
	|	Фондовый";
	
	
	Если ИмяМакета = "ПФ_MXL_ОтчетКассира_52н" Тогда
		ЗапросТекст = СтрЗаменить(ЗапросТекст , "&ДокументЛистКассовойКниги ", "Документ.ЛистКассовойКниги_52н ");
	    ЗапросТекст = СтрЗаменить(ЗапросТекст , "&ДокументЛистКассовойКнигиФондовый ", "Документ.ЛистКассовойКнигиФондовый_52н ");
		ЗапросТекст = СтрЗаменить(ЗапросТекст , "&УсловиеРасхождения ", "ВЫБОР
		|		КОГДА ЕСТЬNULL(Листы.ПриходУчреждение, 0) <> ЕСТЬNULL(Ордера.ПриходУчреждениеУч, 0)
		|				ИЛИ ЕСТЬNULL(Листы.РасходУчреждение, 0) <> ЕСТЬNULL(Ордера.РасходУчреждениеУч, 0)
		|				ИЛИ ЕСТЬNULL(Листы.ПриходВремРасп, 0) <> ЕСТЬNULL(Ордера.ПриходВремРаспУч, 0)
		|				ИЛИ ЕСТЬNULL(Листы.РасходВремРасп, 0) <> ЕСТЬNULL(Ордера.РасходВремРаспУч, 0)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ ");                                       

	Иначе
		ЗапросТекст = СтрЗаменить(ЗапросТекст , "&ДокументЛистКассовойКниги ", "Документ.ЛистКассовойКниги ");
	    ЗапросТекст = СтрЗаменить(ЗапросТекст , "&ДокументЛистКассовойКнигиФондовый ", "Документ.ЛистКассовойКнигиФондовый ");
		ЗапросТекст = СтрЗаменить(ЗапросТекст , "&УсловиеРасхождения ", "ВЫБОР
		|		КОГДА ЕСТЬNULL(Листы.ПриходБюджет, 0) <> ЕСТЬNULL(Ордера.ПриходБюджетУч, 0)
		|				ИЛИ ЕСТЬNULL(Листы.РасходБюджет, 0) <> ЕСТЬNULL(Ордера.РасходБюджетУч, 0)
		|				ИЛИ ЕСТЬNULL(Листы.ПриходВнеБюдж, 0) <> ЕСТЬNULL(Ордера.ПриходВнеБюджУч, 0)
		|				ИЛИ ЕСТЬNULL(Листы.РасходВнеБюдж, 0) <> ЕСТЬNULL(Ордера.РасходВнеБюджУч, 0)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ ");
	
	КонецЕсли;	
	
	Запрос.Текст = ЗапросТекст;
	Таблица = Запрос.Выполнить().Выгрузить();
	
	//
	//	Указание Банка России от 11.03.2014 N 3210-У  (вступает в силу с 1 июня 2014 года)
	//"О порядке ведения кассовых операций юридическими лицами и упрощенном порядке ведения кассовых операций 
	//индивидуальными предпринимателями и субъектами малого предпринимательства"
	//(Зарегистрировано в Минюсте России 23.05.2014 N 32404)
	//п.4.6 ...Если в течение рабочего дня кассовые операции не проводились, записи в кассовую книгу 0310004 не осуществляются.
    //
	Если ФормироватьЛистыБезДвижений Тогда
		
		ДополнитьОстатками(Таблица);
		
	КонецЕсли;	
	
	Таблица.Сортировать("Дата, Валюта, Фондовый");
	
	МассивДат = Таблица.ВыгрузитьКолонку("Дата");
		
	БлижайшиеДаты = Неопределено;
	ОсновнойКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	Если НЕ ОсновнойКалендарь = Неопределено Тогда
		БлижайшиеДаты = КалендарныеГрафики.БлижайшиеРабочиеДаты(ОсновнойКалендарь, МассивДат);
	КонецЕсли;	
	
	ЛистыКассовойКниги.Загрузить(Таблица);
	
	Для каждого ТекСтр Из ЛистыКассовойКниги Цикл
		
		ТекСтр.ДеньНедели = ДниНедели[ДеньНедели(ТекСтр.Дата) - 1];
		Если НЕ БлижайшиеДаты = Неопределено Тогда
			ТекСтр.Рабочий = ?(БлижайшиеДаты.Получить(ТекСтр.Дата) = ТекСтр.Дата, 2, 1);
		Иначе
			ТекСтр.Рабочий = ?(ДеньНедели(ТекСтр.Дата) < 6, 2, 1);
		КонецЕсли;	 
		
		Если ЗначениеЗаполнено(ТекСтр.ЛистКассовойКниги) Тогда
			Если ТекСтр.Расхождения Тогда
				ТекСтр.Состояние = "Перезаполнить";
				ТекСтр.Исправить = Истина;
			Иначе
				ТекСтр.Состояние = "Не требуется";
				ТекСтр.Исправить = Ложь;
			КонецЕсли; 	
		Иначе
			ТекСтр.Состояние = "Создать";
			ТекСтр.Исправить = (ТекСтр.Рабочий = 2);
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьТабличнуюЧасть()

// Процедура создает новые и перезаполняет имеющиеся листы кассовой книги
//
// Параметры
//  СписокИзмененных  - Массив - Массив изменных документов, для последующей печати
//
Процедура ИсправитьКассовуюКнигу(СписокИзмененных = Неопределено, Интерактивно = Истина) Экспорт
	
	СписокИзмененных = Новый Массив;
	
	ОтдельнаяКассоваяКнига = ПолучитьФункциональнуюОпцию("ФондоваяКнигаОтдельноОтДенежной");
	
	Если ИмяМакета = "ПФ_MXL_ОтчетКассира_52н" Тогда
		ДокЛистКК 	= "ЛистКассовойКниги_52н";
		ДокЛистККФ 	= "ЛистКассовойКнигиФондовый_52н";
	Иначе
		ДокЛистКК 	= "ЛистКассовойКниги";
		ДокЛистККФ 	= "ЛистКассовойКнигиФондовый";
	КонецЕсли;
	
	Для каждого ТекСтр Из ЛистыКассовойКниги Цикл
		
		Если ТекСтр.Исправить Тогда
			
			Если ЗначениеЗаполнено(ТекСтр.ЛистКассовойКниги) Тогда
				
				ЛистОбъект = ТекСтр.ЛистКассовойКниги.ПолучитьОбъект();
				ТекстСообщения = НСтр("ru='Изменен отчет кассира: '");
				
			Иначе
				
				ТекстСообщения = НСтр("ru='Создан отчет кассира: '");
				
				Если (НЕ ТекСтр.Фондовый) или (НЕ ОтдельнаяКассоваяКнига) Тогда
					
					ЛистОбъект = Документы[ДокЛистКК].СоздатьДокумент();
					ЛистОбъект.Организация		= Организация;
					ЛистОбъект.Подразделение	= Подразделение;
					ЛистОбъект.ВалютаДокумента 	= ТекСтр.Валюта;
					ЛистОбъект.Дата 			= КонецДня(ТекСтр.Дата);
					ЛистОбъект.Фондовый 		= ТекСтр.Фондовый;
					
					ЛистОбъект.ГлБухгалтер 	= ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(	Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, 
					Организация, ЛистОбъект.Дата, Подразделение).ОтветственноеЛицоСсылка;
					
					ЛистОбъект.Кассир		= ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(	Перечисления.ОтветственныеЛицаОрганизаций.Кассир, 
					Организация, ЛистОбъект.Дата, Подразделение).ОтветственноеЛицоСсылка;
					
				Иначе
					
					ЛистОбъект = Документы[ДокЛистККФ].СоздатьДокумент();
					ЛистОбъект.Организация 		= Организация;
					ЛистОбъект.Подразделение	= Подразделение;
					ЛистОбъект.Дата 			= КонецДня(ТекСтр.Дата);
					
					ЛистОбъект.ГлБухгалтер 	= ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(	Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, 
					Организация, ЛистОбъект.Дата, Подразделение).ОтветственноеЛицоСсылка;
					
					ЛистОбъект.Кассир		= ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(	Перечисления.ОтветственныеЛицаОрганизаций.Кассир, 
					Организация, ЛистОбъект.Дата, Подразделение).ОтветственноеЛицоСсылка;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			ЛистОбъект.ЗаполнитьДокумент();
			ЛистОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			ТекстСообщенияПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 № %2 за %3.'"), 
			ТекстСообщения, ЛистОбъект.НомерЛиста, Формат(ЛистОбъект.Дата,"ДФ=dd.MM.yyyy"));   
			
			Если Интерактивно Тогда 
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю, ЛистОбъект.Ссылка);
				СписокИзмененных.Добавить(ЛистОбъект.Ссылка);
			Иначе
				СписокИзмененных.Добавить(ТекстСообщенияПользователю);
			КонецЕсли;	
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры // ИсправитьКассовуюКнигу()
	
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НачалоДня(ДатаНачала) > КонецДня(ДатаКонца) 
		И Не ДатаКонца = '00010101' Тогда
		
		ТекстСообщения = НСтр("ru = 'Неправильно задан период формирования отчета!
		|Дата начала больше даты окончания периода.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.Период",, Отказ);
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",					Организация);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям",				Не ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("Подразделение",					Подразделение);
	Запрос.УстановитьПараметр("ЕстьПодразделение",				ЗначениеЗаполнено(Подразделение));
	
	Если ИмяМакета = "ПФ_MXL_ОтчетКассира_52н" Тогда
		
		Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаНачала));
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛистКассовойКниги.Ссылка
		|ИЗ
		|	Документ.ЛистКассовойКниги КАК ЛистКассовойКниги
		|ГДЕ
		|	(ЛистКассовойКниги.Организация = &Организация
		|			ИЛИ &ПоВсемОрганизациям)
		|	И (&ЕстьПодразделение
		|				И ЛистКассовойКниги.Подразделение = &Подразделение
		|			ИЛИ НЕ &ЕстьПодразделение
		|				И (ЛистКассовойКниги.Подразделение ЕСТЬ NULL 
		|					ИЛИ ЛистКассовойКниги.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|					ИЛИ НЕ ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига))
		|	И ЛистКассовойКниги.Проведен
		|	И ЛистКассовойКниги.Дата > &Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистКассовойКнигиФондовый.Ссылка
		|ИЗ
		|	Документ.ЛистКассовойКнигиФондовый КАК ЛистКассовойКнигиФондовый
		|ГДЕ
		|	(ЛистКассовойКнигиФондовый.Организация = &Организация
		|			ИЛИ &ПоВсемОрганизациям)
		|	И (&ЕстьПодразделение
		|				И ЛистКассовойКнигиФондовый.Подразделение = &Подразделение
		|			ИЛИ НЕ &ЕстьПодразделение
		|				И (ЛистКассовойКнигиФондовый.Подразделение ЕСТЬ NULL 
		|					ИЛИ ЛистКассовойКнигиФондовый.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|					ИЛИ НЕ ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига))
		|	И ЛистКассовойКнигиФондовый.Дата > &Дата";
		
		ТекстСообщения = НСтр("ru = 'Невозможно сформировать отчеты кассира по инстр. 52н за указанный период!
		|Существуют отчеты кассира по инстр. 173н с датой, большей даты начала периода.'");
		
	Иначе
		
		Запрос.УстановитьПараметр("Дата",	КонецДня(ДатаКонца));
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ЛистКассовойКниги.Ссылка
		|ИЗ
		|	Документ.ЛистКассовойКниги_52н КАК ЛистКассовойКниги
		|ГДЕ
		|	(ЛистКассовойКниги.Организация = &Организация
		|			ИЛИ &ПоВсемОрганизациям)
		|	И (&ЕстьПодразделение
		|				И ЛистКассовойКниги.Подразделение = &Подразделение
		|			ИЛИ НЕ &ЕстьПодразделение
		|				И (ЛистКассовойКниги.Подразделение ЕСТЬ NULL 
		|					ИЛИ ЛистКассовойКниги.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|					ИЛИ НЕ ЛистКассовойКниги.Подразделение.ВедетсяКассоваяКнига))
		|	И ЛистКассовойКниги.Проведен
		|	И ЛистКассовойКниги.Дата < &Дата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛистКассовойКнигиФондовый.Ссылка
		|ИЗ
		|	Документ.ЛистКассовойКнигиФондовый_52н КАК ЛистКассовойКнигиФондовый
		|ГДЕ
		|	(ЛистКассовойКнигиФондовый.Организация = &Организация
		|			ИЛИ &ПоВсемОрганизациям)
		|	И (&ЕстьПодразделение
		|				И ЛистКассовойКнигиФондовый.Подразделение = &Подразделение
		|			ИЛИ НЕ &ЕстьПодразделение
		|				И (ЛистКассовойКнигиФондовый.Подразделение ЕСТЬ NULL 
		|					ИЛИ ЛистКассовойКнигиФондовый.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|					ИЛИ НЕ ЛистКассовойКнигиФондовый.Подразделение.ВедетсяКассоваяКнига))
		|	И ЛистКассовойКнигиФондовый.Дата < &Дата";
		
		ТекстСообщения = НСтр("ru = 'Невозможно сформировать отчеты кассира по инстр. 173н за указанный период!
		|Существуют отчеты кассира по инстр. 52н с датой, меньщей даты окончания периода.'")							 
		
	КонецЕсли;
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);	
	
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Дополняет таблицу датами по которым были начальные остатки, но не было движений
//
// Параметры
//  Таблица  - ТаблицаЗначений - Таблица, содержащая движения за период
//
Процедура ДополнитьОстатками(Таблица)
	
	ТаблицаДополнения = Таблица.СкопироватьКолонки();
	
	Запрос = Новый Запрос;
	
	П1 = КонецДня(ДатаНачала);
	П2 = КонецДня(ДатаКонца)+1;
	
	ТаблицаПериодов = Новый ТаблицаЗначений;
	ТаблицаПериодов.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	Сутки = 24*60*60;
	
	Пока П1 < П2 Цикл
		
		ТаблицаПериодов.Добавить().Период = П1;
		П1 = П1 + Сутки;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Периоды",			ТаблицаПериодов);
	Запрос.УстановитьПараметр("ДатаНачала",			НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаКонца",			КонецДня(ДатаКонца));
	Запрос.УстановитьПараметр("Организация",		Организация); 
	Запрос.УстановитьПараметр("ПоВсемОрганизациям",	Не ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("ТаблицаДвижений",	Таблица);
	Запрос.УстановитьПараметр("Подразделение",		Подразделение);
	Запрос.УстановитьПараметр("ЕстьПодразделение",	ЗначениеЗаполнено(Подразделение));
	
	ЗапросТекст =
	"ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(НаличныеДенежныеСредстваОстаткиИОбороты.Период, ДЕНЬ) КАК Дата,
	|	НаличныеДенежныеСредстваОстаткиИОбороты.Валюта КАК Валюта,
	|	ЛОЖЬ КАК ФондовыйУч,
	|	НаличныеДенежныеСредстваОстаткиИОбороты.КФО КАК КФО,
	|	0 КАК СуммаНачальныйОстаток,
	|	0 КАК СуммаКонечныйОстаток,
	|	НаличныеДенежныеСредстваОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
	|	НаличныеДенежныеСредстваОстаткиИОбороты.СуммаРасход КАК СуммаРасход
	|ПОМЕСТИТЬ ТТ
	|ИЗ
	|	РегистрНакопления.НаличныеДенежныеСредства.ОстаткиИОбороты(
	|			&ДатаНачала,
	|			&ДатаКонца,
	|			День,
	|			Движения,
	|			&ПоВсемОрганизациям
	|				ИЛИ Организация = &Организация) КАК НаличныеДенежныеСредстваОстаткиИОбороты
	|ГДЕ
	|	(&ЕстьПодразделение
	|				И НаличныеДенежныеСредстваОстаткиИОбороты.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (НаличныеДенежныеСредстваОстаткиИОбороты.Подразделение ЕСТЬ NULL 
	|					ИЛИ НаличныеДенежныеСредстваОстаткиИОбороты.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(ДенежныеДокументыОстаткиИОбороты.Период, ДЕНЬ),
	|	ВалютаРегламентированногоУчета.Значение,
	|	ИСТИНА,
	|	ДенежныеДокументыОстаткиИОбороты.КФО,
	|	0,
	|	0,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаПриход,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРасход
	|ИЗ
	|	РегистрНакопления.ДенежныеДокументы.ОстаткиИОбороты(
	|			&ДатаНачала,
	|			&ДатаКонца,
	|			День,
	|			ДвиженияИГраницыПериода,
	|			&ПоВсемОрганизациям
	|				ИЛИ Организация = &Организация) КАК ДенежныеДокументыОстаткиИОбороты,
	|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|ГДЕ
	|	(&ЕстьПодразделение
	|				И ДенежныеДокументыОстаткиИОбороты.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ДенежныеДокументыОстаткиИОбороты.Подразделение ЕСТЬ NULL 
	|					ИЛИ ДенежныеДокументыОстаткиИОбороты.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ),
	|	ВалютаРегламентированногоУчета.Значение,
	|	ИСТИНА,
	|	ДенежныеДокументыОстатки.КФО,
	|	ДенежныеДокументыОстатки.СуммаОстаток,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеДокументы.Остатки(
	|			&ДатаНачала,
	|			&ПоВсемОрганизациям
	|				ИЛИ Организация = &Организация) КАК ДенежныеДокументыОстатки,
	|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|ГДЕ
	|	(&ЕстьПодразделение
	|				И ДенежныеДокументыОстатки.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (ДенежныеДокументыОстатки.Подразделение ЕСТЬ NULL 
	|					ИЛИ ДенежныеДокументыОстатки.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ),
	|	НаличныеДенежныеСредстваОстатки.Валюта,
	|	ЛОЖЬ,
	|	НаличныеДенежныеСредстваОстатки.КФО,
	|	НаличныеДенежныеСредстваОстатки.СуммаОстаток,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.НаличныеДенежныеСредства.Остатки(
	|			&ДатаНачала,
	|			&ПоВсемОрганизациям
	|				ИЛИ Организация = &Организация) КАК НаличныеДенежныеСредстваОстатки
	|ГДЕ
	|	(&ЕстьПодразделение
	|				И НаличныеДенежныеСредстваОстатки.Подразделение = &Подразделение
	|			ИЛИ НЕ &ЕстьПодразделение
	|				И (НаличныеДенежныеСредстваОстатки.Подразделение ЕСТЬ NULL 
	|					ИЛИ НаличныеДенежныеСредстваОстатки.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период
	|ПОМЕСТИТЬ Периоды
	|ИЗ
	|	&Периоды КАК Периоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период КАК Дата,
	|	ТТ.Валюта,
	|	ТТ.ФондовыйУч,
	|	СУММА(ВЫБОР
	|			КОГДА ТТ.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА ТТ.СуммаНачальныйОстаток + ВЫБОР
	|						КОГДА Периоды.Период = ТТ.Дата
	|							ТОГДА 0
	|						ИНАЧЕ ТТ.СуммаПриход - ТТ.СуммаРасход
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачОстБюджетУч,
	|	СУММА(ВЫБОР
	|			КОГДА ТТ.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА ТТ.СуммаНачальныйОстаток + ТТ.СуммаПриход - ТТ.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КонОстБюджетУч,
	|	СУММА(ВЫБОР
	|			КОГДА ТТ.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА ТТ.СуммаНачальныйОстаток + ВЫБОР
	|						КОГДА Периоды.Период = ТТ.Дата
	|							ТОГДА 0
	|						ИНАЧЕ ТТ.СуммаПриход - ТТ.СуммаРасход
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачОстВнеБюджУч,
	|	СУММА(ВЫБОР
	|			КОГДА ТТ.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)
	|				ТОГДА ТТ.СуммаНачальныйОстаток + ТТ.СуммаПриход - ТТ.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КонОстВнеБюджУч,
	|	СУММА(ВЫБОР
	|			КОГДА ТТ.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА ТТ.СуммаНачальныйОстаток + ТТ.СуммаПриход - ТТ.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КонОстУчреждениеУч,
	|	СУММА(ВЫБОР
	|			КОГДА ТТ.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА ТТ.СуммаНачальныйОстаток + ТТ.СуммаПриход - ТТ.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КонОстВремРаспУч,
	|	СУММА(ВЫБОР
	|			КОГДА ТТ.КФО <> ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА ТТ.СуммаНачальныйОстаток + ВЫБОР
	|						КОГДА Периоды.Период = ТТ.Дата
	|							ТОГДА 0
	|						ИНАЧЕ ТТ.СуммаПриход - ТТ.СуммаРасход
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачОстУчреждениеУч,
	|	СУММА(ВЫБОР
	|			КОГДА ТТ.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ВременноеРаспоряжение)
	|				ТОГДА ТТ.СуммаНачальныйОстаток + ВЫБОР
	|						КОГДА Периоды.Период = ТТ.Дата
	|							ТОГДА 0
	|						ИНАЧЕ ТТ.СуммаПриход - ТТ.СуммаРасход
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НачОстВремРаспУч
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	Периоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТТ КАК ТТ
	|		ПО Периоды.Период >= ТТ.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Период,
	|	ТТ.Валюта,
	|	ТТ.ФондовыйУч
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДвижений.Дата,
	|	ТаблицаДвижений.Валюта,
	|	ТаблицаДвижений.Фондовый КАК ФондовыйУч
	|ПОМЕСТИТЬ ТаблицаДвижений
	|ИЗ
	|	&ТаблицаДвижений КАК ТаблицаДвижений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Период,
	|	ВложенныйЗапрос.Валюта,
	|	ВложенныйЗапрос.ФондовыйУч
	|ПОМЕСТИТЬ ВсеПериоды
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Остатки.Валюта КАК Валюта,
	|		Остатки.ФондовыйУч КАК ФондовыйУч
	|	ИЗ
	|		Остатки КАК Остатки) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ВложенныйЗапрос.Валюта = Остатки.Валюта
	|			И ВложенныйЗапрос.ФондовыйУч = Остатки.ФондовыйУч,
	|	Периоды КАК Периоды
	|ГДЕ
	|	Остатки.Дата В
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(Остатки1.Дата)
	|			ИЗ
	|				Остатки КАК Остатки1
	|			ГДЕ
	|				Остатки1.Валюта = ВложенныйЗапрос.Валюта
	|				И Остатки1.ФондовыйУч = ВложенныйЗапрос.ФондовыйУч
	|				И Остатки1.Дата <= Периоды.Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеПериоды.Период КАК Дата,
	|	ВсеПериоды.Валюта КАК Валюта,
	|	ВсеПериоды.ФондовыйУч КАК Фондовый,
	|	Остатки.НачОстБюджетУч КАК НачОстБюджетУч,
	|	Остатки.КонОстБюджетУч КАК КонОстБюджетУч,
	|	Остатки.НачОстВнеБюджУч КАК НачОстВнеБюджУч,
	|	Остатки.КонОстВнеБюджУч КАК КонОстВнеБюджУч,
	|	Остатки.НачОстУчреждениеУч КАК НачОстУчреждениеУч,
	|	Остатки.КонОстУчреждениеУч КАК КонОстУчреждениеУч,
	|	Остатки.НачОстВремРаспУч КАК НачОстВремРаспУч,
	|	Остатки.КонОстВремРаспУч КАК КонОстВремРаспУч
	|ИЗ
	|	ВсеПериоды КАК ВсеПериоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ВсеПериоды.Период = Остатки.Дата
	|			И ВсеПериоды.Валюта = Остатки.Валюта
	|			И ВсеПериоды.ФондовыйУч = Остатки.ФондовыйУч
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДвижений КАК ТаблицаДвижений
	|		ПО ВсеПериоды.Период = ТаблицаДвижений.Дата
	|			И ВсеПериоды.Валюта = ТаблицаДвижений.Валюта
	|			И ВсеПериоды.ФондовыйУч = ТаблицаДвижений.ФондовыйУч
	|ГДЕ
	|	&УсловиеОстатки
	|	И ТаблицаДвижений.Дата ЕСТЬ NULL ";
	
	Если ИмяМакета = "ПФ_MXL_ОтчетКассира_52н" Тогда
		ЗапросТекст = СтрЗаменить(ЗапросТекст , "&УсловиеОстатки", "
		|	(Остатки.НачОстУчреждениеУч <> 0
		|			ИЛИ Остатки.НачОстВремРаспУч <> 0
		|			ИЛИ Остатки.КонОстУчреждениеУч <> 0
		|			ИЛИ Остатки.КонОстВремРаспУч <> 0) ");
		
	Иначе
		ЗапросТекст = СтрЗаменить(ЗапросТекст , "&УсловиеОстатки", "
		|	(Остатки.НачОстБюджетУч <> 0
		|			ИЛИ Остатки.НачОстВнеБюджУч <> 0
		|			ИЛИ Остатки.КонОстБюджетУч <> 0
		|			ИЛИ Остатки.КонОстВнеБюджУч <> 0) ");
		
	КонецЕсли;

	
	
	Запрос.Текст = ЗапросТекст;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Выборка);
	
	КонецЦикла;
	
КонецПроцедуры // ДополнитьОстатками(Таблица)()

#КонецОбласти

#Область ИнициализацияПеременныхМодуля

ДниНедели = Новый Массив;
ДниНедели.Добавить("Понедельник");
ДниНедели.Добавить("Вторник");
ДниНедели.Добавить("Среда");
ДниНедели.Добавить("Четверг");
ДниНедели.Добавить("Пятница");
ДниНедели.Добавить("Суббота");
ДниНедели.Добавить("Воскресенье");

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
